#pragma once
#include <iostream>
#include "Skill.h"
#include "Type.h"


using namespace std;


//네이티오 2마리
Skill 전광석화 ("전광석화", true,40, 0, TYPE::노말, 100, false, 0, 0, 0, 0, 0);
Skill 이상한빛("이상한빛", false,0, 5, TYPE::악, 100, true, 100, 5, 0, 0, 0); //혼란
Skill 미래예지("미래예지", true, 120, 1, TYPE::에스퍼, 100, false, 0, 0, 0, 0, 0);
Skill 사이코키네시스("사이코키네시스", true, 90, 3, TYPE::에스퍼, 100, true, 0, 0, 0, -4, 0);

//야도란
Skill 망각술("망각술", false, 0, 5, TYPE::에스퍼, 100, true, 100, 0, 4, 0, 0);
Skill 누르기("누르기", true, 85, 2, TYPE::노말, 100, true, 30, 2, 0, 0, 0);
/*사이코키네시스 [중복]*/
Skill 하이드로펌프("하이드로펌프", true, 110, 1, TYPE::물, 80, false, 0, 0, 0, 0, 0);

//루주라
Skill 악마의키스("악마의키스", false, 0, 5, TYPE::노말, 75, true, 100, 0, 0, -2, 0);//특공낮춤
Skill 냉동펀치("냉동펀치", true, 75, 2, TYPE::얼음, 100, true, 10, 3, 0, 0, 0);
Skill 눈사태("눈사태", true, 60, 0, TYPE::얼음, 100, false, 0, 0, 0, 0, 0);
Skill 사이코쇼크("사이코쇼크", true, 80, 0, TYPE::에스퍼, 100, false, 0, 0, 0, 0, 0);

//나시
/*기가 드레인 중복
사이코키네시스
사이코쇼크*/
Skill 리플렉터("리플렉터", false, 0, 5, TYPE::에스퍼, 100, true, 100, 0, 4, 0, 0);

//────────────────────────────────────────────────────

//또가스
Skill 오물공격("오물공격", true, 65, 3, TYPE::독, 100, true, 30, 1, 0, 0, 0);//독
Skill 스모그("스모그", true, 30, 3, TYPE::독, 70, true, 40, 1, 0, 0, 0);//독
Skill 몸통박치기("몸통박치기", true, 40, 0, TYPE::노말, 100, false, 0, 0, 0, 0, 0);
/*누르기[중복]*/

//또도가스
/*오물공격[중복]*/
/*스모그 [중복]*/
Skill 용해액("용해액", true, 40, 3, TYPE::독, 100, true, 10, 0, 0, -4, 0);
Skill 원더스팀("원더스팀", true, 90, 3, TYPE::노말, 95, true, 20, 5, 0, 0, 0); //혼란

//질뻐기
Skill 독가스("독가스", false, 0, 5, TYPE::독, 90, true, 100, 1, 0, 0, 0); //독
Skill 작아지기("작아지기", false, 0, 5, TYPE::노말, 100, true, 100, 0, 6, 0, 0); //회피상승
/*오물공격[중복]*/
Skill 핥기("핥기", true, 30, 2, TYPE::악, 100, true, 30, 2, 0, 0, 0);//마비

//도나리
/*독가루
사이코키네시스*/
Skill 그림자분신("그림자분신", false, 0, 5, TYPE::노말, 100, true, 100, 0, 6, 0, 0);
Skill 흡혈("흡혈", true, 60, 2, TYPE::노말, 100, true, 100, 0, 0, 0, 40); //회복

//크로벳
/*독가루
10만볼트
전광석화
그림자분신*/



//────────────────────────────────────────────────────

//롱스톤x2
Skill 돌떨구기("돌떨구기", true, 50, 0, TYPE::바위, 90, false, 0, 0, 0, 0, 0);
Skill 분노("분노", true, 20, 2, TYPE::바위, 100, true, 100, 0, 1, 0, 0);
Skill 힘껏치기("힘껏치기", true, 80, 0, TYPE::바위, 75, false, 0, 0, 0, 0, 0);
Skill 단단해지기("단단해지기", false, 0, 5, TYPE::노말, 100, true, 100, 0, 3, 0, 0); //방어상승

//홍수몬
/*냉동펀치[중복]*/
Skill 불꽃펀치("불꽃펀치", true, 75, 2, TYPE::불, 100, true, 10, 4, 0, 0, 0);
Skill 번개펀치("번개펀치", true, 75, 2, TYPE::전기, 100, true, 10, 2, 0, 0, 0);
Skill 메가톤펀치("메가톤펀치", true, 40, 4, TYPE::노말, 85, false, 0, 0, 0, 0, 0); //hp비례로 재정의

//시라소몬
Skill 점프킥("점프킥", true, 100, 0, TYPE::격투, 95, false, 0, 0, 0, 0, 0);
Skill 기충전("기충전", false, 0, 0, TYPE::노말, 100, true, 100, 0, 1, 0, 0);
Skill 무릎차기("무릎차기", true, 130, 0, TYPE::격투, 90, false, 0, 0, 0, 0, 0);
Skill 메가톤킥("메가톤킥", true, 40, 4, TYPE::노말, 75, false, 0, 0, 0, 0, 0); //hp비례로 재정의

//괴력몬
Skill 째려보기("째려보기", false, 100, 5, TYPE::노말, 100, true, 0, 0, 0, -3, 0);
//기충전
Skill 땅가르기("땅가르기", true, 100, 4, TYPE::격투, 10, false, 0, 0, 0, 0, 0);
Skill 지옥의바퀴("지옥의바퀴", true, 80, 0, TYPE::격투, 80, false, 0, 0, 0, 0, 0);

//────────────────────────────────────────────────────

//쥬레곤
Skill 잠자기("잠자기", false, 0, 5, TYPE::에스퍼, 100, true, 100, 6, 0, 0, 100);
Skill 거품광선("거품광선", true, 65, 3, TYPE::물, 100, true, 10, 0, 0, -5, 0);//스피드하락
Skill 오로라빔("오로라빔", true, 65, 3, TYPE::얼음, 100, true, 10, 0, 0, -1, 0);//공격하락
Skill 파도타기("파도타기", true, 90, 1, TYPE::물, 100, false, 0, 0, 0, 0, 0);

//파르셸
Skill 초음파("초음파", false, 0, 5, TYPE::노말, 55, true, 100, 5, 0, 0, 0); //혼란
Skill 냉동빔("냉동빔", true, 90, 3, TYPE::얼음, 100, true, 10, 3, 0, 0, 0);
/*하이드로펌프[중복]*/
Skill 독찌르기("독찌르기", true, 80, 2, TYPE::독, 100, true, 30, 1, 0, 0, 0);

//라프라스
/*하이드로펌프[중복]*/
Skill 방전("방전", true, 110, 3, TYPE::전기, 70, true, 30, 2, 0, 0, 0); //마비
Skill 눈보라("눈보라", true, 110, 3, TYPE::얼음, 70, true, 10, 3, 0, 0, 0);//얼음
/*사이코키네시스[중복]*/

//메꾸리
Skill 지진("지진", true, 100, 0, TYPE::바위, 100, false, 0, 0, 0, 0, 0);
//눈보라
Skill 이판사판태클("이판사판태클", true, 120, 0, TYPE::노말, 100, false, 0, 0, 0, 0, 0);
Skill 스톤샤워("스톤샤워", true, 75, 0, TYPE::바위, 90, false, 0, 0, 0, 0, 0);



//────────────────────────────────────────────────────
//플레이어!!

//피카츄
/*전광석화[중복]*/
Skill 전기자석파("전기자석파", false, 0, 5, TYPE::전기, 100, true, 100, 2, 0, 0, 0); //마비
Skill HP회복("HP회복", false, 0, 5, TYPE::노말, 100, true, 100, 0, 0, 0, 50); //회복
Skill 볼트태클("볼트태클", true, 50, 4, TYPE::전기, 90, true, 0, -1, 0, 0, 0); //hp비례로 재정의

//리자몽
Skill 파괴광선("파괴광선", true, 150, 3, TYPE::노말, 90, false, 0, 0, -2, -4, 0);
Skill 화염방사("화염방사", true, 95, 3, TYPE::불, 100, true, 10, 4, 0, 0, 0);//화상
/*잠자기[중복]*/
Skill 플레어드라이브("플레어드라이브", true, 50, 4, TYPE::불, 90, false, 0, 0, 0, 0, 0); //hp비례로 재정의

//이상해꽃
/*몸통박치기[중복]*/
Skill 독가루("독가루", false, 0, 5, TYPE::독, 75, true, 100, 1, 0, 0, 0); //독
Skill 기가드레인("기가드레인", true, 80, 3, TYPE::풀, 100, true, 100, 0, 0, 0, 30); //회복
Skill 리프스톰("리프스톰", true, 60, 4, TYPE::풀, 80, false, 0, 0, 0, 0, 0); //hp비례로 재정의